Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
static const en_peri0_trig_input_debugreducation1_t peri0_tr_io_input[MICROPY_PY_MACHINE_PERI0_TR_IO_INPUT_NUM_ENTRIES] = {
    MICROPY_PY_MACHINE_FOR_ALL_PERI0_TR_IO_INPUTS(MAP_COUNTER_PIN_INPUT_TRIGGER)
};

// Restore the routed source pin back to GPIO input mode.
static void machine_counter_restore_src_pin(machine_counter_obj_t *self) {
    if (self->src_pin == NULL) {
        return;
    }
    GPIO_PRT_Type *port = Cy_GPIO_PortToAddr(self->src_pin->port);
    Cy_GPIO_SetHSIOM(port, self->src_pin->pin, HSIOM_SEL_GPIO);
    Cy_GPIO_SetDrivemode(port, self->src_pin->pin, CY_GPIO_DM_HIGHZ);
    self->src_pin = NULL;
}

// Disable the underlying TCPWM counter channel.
static void machine_counter_stop_hw(machine_counter_obj_t *self) {
    Cy_TCPWM_Counter_Disable(TCPWM0, self->counter_num);
}

// Disable index/reset pin IRQs (if configured) and release pin ownership.
static void machine_counter_disable_aux_irqs(machine_counter_obj_t *self) {
    // Disable index pin IRQs (if configured) and release pin ownership.
    if (self->index_pin != NULL && self->index_irq_obj != MP_OBJ_NULL) {
        mp_obj_t pos_args[] = {
            MP_OBJ_FROM_PTR((machine_pin_obj_t *)self->index_pin),
            mp_const_none,
        };
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, 0, NULL);
        machine_pin_irq(2, pos_args, &kw_args);
    }

    // Disable reset pin IRQs (if configured) and release pin ownership.
    if (self->reset_pin != NULL && self->reset_irq_obj != MP_OBJ_NULL
        && self->reset_pin != self->index_pin) {
        mp_obj_t pos_args[] = {
            MP_OBJ_FROM_PTR((machine_pin_obj_t *)self->reset_pin),
            mp_const_none,
        };
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, 0, NULL);
        machine_pin_irq(2, pos_args, &kw_args);
    }

    self->index_pin = NULL;
    self->reset_pin = NULL;
    self->index_irq_obj = MP_OBJ_NULL;
    self->reset_irq_obj = MP_OBJ_NULL;
}

// Disable and unregister the counter IRQ if it is currently active.
static void machine_counter_stop_irq(machine_counter_obj_t *self) {
    if (self->irq_active) {
        sys_int_deinit(&self->irq_cfg);
        self->irq_active = false;
    }
}

// Return the cycles counter as signed 16-bit value.
static inline int16_t machine_counter_cycles_get(const machine_counter_obj_t *self) {
    return (int16_t)self->cycles_u16;
}

static inline uint32_t machine_counter_interrupt_mask(const machine_counter_obj_t *self) {
    return CY_TCPWM_INT_ON_TC | (self->match_enabled ? CY_TCPWM_INT_ON_CC0 : 0U);
}

static inline void machine_counter_apply_interrupt_mask(const machine_counter_obj_t *self) {
    Cy_TCPWM_SetInterruptMask(TCPWM0, self->counter_num, machine_counter_interrupt_mask(self));
}

static inline void clear_counter_irqs(const machine_counter_obj_t *self, uint32_t mask) {
    Cy_TCPWM_ClearInterrupt(TCPWM0, self->counter_num, mask);
}

// Increment/decrement cycles counter with 16-bit wrap semantics.
static inline void machine_counter_cycles_step(machine_counter_obj_t *self) {
    if (self->direction == COUNTER_DIR_DOWN) {
        self->cycles_u16--;
    } else {
        self->cycles_u16++;
    }
}

static mp_uint_t machine_counter_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);
    self->mp_irq_trigger = new_trigger;
    return 0;
}

static mp_uint_t machine_counter_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (info_type == MP_IRQ_INFO_FLAGS) {
        return self->mp_irq_flags;
    } else if (info_type == MP_IRQ_INFO_TRIGGERS) {
        return self->mp_irq_trigger;
    }
    return 0;
}

static const mp_irq_methods_t machine_counter_irq_methods = {
    .trigger = machine_counter_irq_trigger,
    .info = machine_counter_irq_info,
};

static inline void machine_counter_irq_raise(machine_counter_obj_t *self, mp_uint_t flags) {
    if (self->mp_irq_obj == NULL) {
        return;
    }

    mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
    self->mp_irq_flags = flags;
    bool call_handler = (self->mp_irq_obj->handler != mp_const_none)
        && ((self->mp_irq_trigger & flags) != 0);
    MICROPY_END_ATOMIC_SECTION(irq_state);

    if (call_handler) {
        mp_irq_handler(self->mp_irq_obj);
    }
}

static mp_obj_t machine_counter_enable_aux_irq(const machine_pin_obj_t *pin, mp_obj_t handler_obj) {
    mp_hal_pin_input(pin);

    mp_obj_t pos_args[] = {
        MP_OBJ_FROM_PTR((machine_pin_obj_t *)pin),
        handler_obj,
    };
    mp_obj_t kw_table[] = {
        MP_OBJ_NEW_QSTR(MP_QSTR_trigger), MP_OBJ_NEW_SMALL_INT(CY_GPIO_INTR_RISING),
        MP_OBJ_NEW_QSTR(MP_QSTR_hard), mp_const_true,
    };
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, MP_ARRAY_SIZE(kw_table) / 2, kw_table);
    return machine_pin_irq(2, pos_args, &kw_args);
}

// Counter terminal-count ISR: track wrap events in software cycles.
static void machine_counter_isr(machine_counter_obj_t *self) {
    uint32_t status = Cy_TCPWM_GetInterruptStatus(TCPWM0, self->counter_num);

    if (status & CY_TCPWM_INT_ON_CC0) {
        clear_counter_irqs(self, CY_TCPWM_INT_ON_CC0);
        machine_counter_irq_raise(self, MACHINE_COUNTER_IRQ_MATCH);
    }

    if (status & CY_TCPWM_INT_ON_TC) {
        clear_counter_irqs(self, CY_TCPWM_INT_ON_TC);
        machine_counter_cycles_step(self);
        machine_counter_irq_raise(self,
            (self->direction == COUNTER_DIR_DOWN)
                ? MACHINE_COUNTER_IRQ_ROLL_UNDER
                : MACHINE_COUNTER_IRQ_ROLL_OVER);
    }
}

// Shared handler for index/reset pin rising edges.
// If update_cycles is true (index), adjust cycles;
// if false (reset), keep cycles unchanged.
static inline void machine_counter_on_aux_event(machine_counter_obj_t *self, bool update_cycles,
    mp_uint_t irq_flag) {
    if (!self->configured) {
        return;
    }

    mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
    if (update_cycles) {
        // Update cycles counter on index pin rising edge.
        machine_counter_cycles_step(self);
    }
    Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
    clear_counter_irqs(self, CY_TCPWM_INT_ON_TC | CY_TCPWM_INT_ON_CC0);
    MICROPY_END_ATOMIC_SECTION(irq_state);
    machine_counter_irq_raise(self, irq_flag);
}

// -------------------------------------------------------------------------- //
// Generate one IRQ handler per Counter id for direct dispatch.
#define COUNTER_IRQ_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static void machine_counter_irq_handler_##id(void) { \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL) { \
            machine_counter_isr(self); \
        } \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_DECL)
#undef COUNTER_IRQ_HANDLER_DECL

// Generate one IRQ handler entry per Counter id for direct dispatch.
#define COUNTER_IRQ_HANDLER_ENTRY(id, counter, irq, pclk, trig) machine_counter_irq_handler_##id,
static const cy_israddress machine_counter_irq_handlers[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_HANDLER_ENTRY)
};
#undef COUNTER_IRQ_HANDLER_ENTRY
// -------------------------------------------------------------------------- //

// -------------------------------------------------------------------------- //
// Generate one index callback per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_HANDLER_DECL(id, counter, irq, pclk, trig) \
    static mp_obj_t machine_counter_index_handler_##id(mp_obj_t pin_in) { \
        (void)pin_in; \
        machine_counter_obj_t *self = counter_obj[id]; \
        if (self != NULL && self->index_pin != NULL) { \
            machine_counter_on_aux_event(self, true, MACHINE_COUNTER_IRQ_INDEX); \
        } \
        return mp_const_none; \
    }
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_HANDLER_DECL)
#undef COUNTER_INDEX_HANDLER_DECL

// Generate one index callback object per Counter id (bound through machine.Pin.irq).
#define COUNTER_INDEX_HANDLER_OBJ_DECL(id, counter, irq, pclk, trig) \
    static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_index_handler_obj_##id, machine_counter_index_handler_##id);
MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_INDEX_HANDLER_OBJ_DECL)
#undef COUNTER_INDEX_HANDLER_OBJ_DECL

